Revit 2027 API
View.SetViewDisplayModel Method
 Sets the view display model settings for the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetViewDisplayModel(
	ViewDisplayModel viewDisplayModel
)
Public Sub SetViewDisplayModel (
	viewDisplayModel As ViewDisplayModel
)
public:
void SetViewDisplayModel(
	ViewDisplayModel^ viewDisplayModel
)
member SetViewDisplayModel :
        viewDisplayModel : ViewDisplayModel -> unit
Parameters
viewDisplayModel ViewDisplayModel
 View display model settings to set.
Exceptions
Exception | Condition
ArgumentException |  The silhouette line style id is not a valid line style to apply to the view.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This view does not contain display-related properties.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace